remove mermaid in docs
